ИСПП/src/AccumulationRegisters/ДвиженияНоменклатураНоменклатура/ДвиженияНоменклатураНоменклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияНоменклатураНоменклатура</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КорКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаВидаУчета</name>
    <type>
      <types>CatalogRef.КлючиАналитикиВидаУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорАналитикаВидаУчета</name>
    <type>
      <types>CatalogRef.КлючиАналитикиВидаУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорАналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИСПП/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>БезвозмезднаяПередачаМежбюджетная</name>
  </enumValues>
  <enumValues>
    <name>БезвозмезднаяПередачаПрочее</name>
  </enumValues>
  <enumValues>
    <name>БезвозмездноеПоступлениеВнутриведомственное</name>
  </enumValues>
  <enumValues>
    <name>БезвозмездноеПоступлениеМежбюджетное</name>
  </enumValues>
  <enumValues>
    <name>БезвозмездноеПоступлениеПрочее</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяПередачаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВнутриведомственноеПеремещение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтРозничногоПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровИзОтделения</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиентаПрошлыхПериодов</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ДоходыОтПереоценкиТоваров</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Изготовление</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаОшибокОкругления</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеПоВозврату</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтпускТоваровВОтделение</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваровСПереоценкой</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовНаСебестоимость</name>
  </enumValues>
  <enumValues>
    <name>РасходыОтПереоценкиТоваров</name>
  </enumValues>
  <enumValues>
    <name>РеализацияВРозницу</name>
  </enumValues>
  <enumValues>
    <name>РеализацияМатериальныхЗапасов</name>
  </enumValues>
  <enumValues>
    <name>СписаниеТоваров</name>
  </enumValues>
  <enumValues>
    <name>СписаниеТоваровПоНазначениюВрача</name>
  </enumValues>
  <enumValues>
    <name>СписаниеТоваровПоТребованию</name>
  </enumValues>
  <enumValues>
    <name>СторноРеализации</name>
  </enumValues>
  <enumValues>
    <name>СторноСписанияНаРасходы</name>
  </enumValues>
</mdclass:Enum>

ИСПП/src/AccumulationRegisters/ДвиженияНоменклатураНоменклатура/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область СлужебныйПрограммныйИнтерфейс

#Область РасчетСебестоимостиТоваров

Функция ХозяйственныеОперацииКорректировки() Экспорт
	
	Операции = Новый Массив;
	Операции.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровИзОтделения);
	Операции.Добавить(Перечисления.ХозяйственныеОперации.Изготовление);
	Операции.Добавить(Перечисления.ХозяйственныеОперации.ПересортицаТоваров);
	Операции.Добавить(Перечисления.ХозяйственныеОперации.ОтпускТоваровВОтделение);
	Операции.Добавить(Перечисления.ХозяйственныеОперации.ПеремещениеТоваров);
	Операции.Добавить(Перечисления.ХозяйственныеОперации.ВнутренняяПередачаТоваров);
	
	Возврат Операции;
	
КонецФункции

Процедура СформироватьДвижениеКорректировки(ПараметрыРасчета, Выборка) Экспорт
	
	Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтпускТоваровВОтделение
	   И Не ЗначениеЗаполнено(Выборка.КорАналитикаВидаУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРегистра = СоздатьНаборЗаписей().Метаданные().Имя;
	ЗаполняемыеПоля = Новый Структура;
	ЗаполняемыеПоля.Вставить("Период");
	ЗаполняемыеПоля.Вставить("ХозяйственнаяОперация");
	ЗаполняемыеПоля.Вставить("АналитикаВидаУчета");
	ЗаполняемыеПоля.Вставить("АналитикаУчетаНоменклатуры");
	ЗаполняемыеПоля.Вставить("КорАналитикаВидаУчета");
	ЗаполняемыеПоля.Вставить("КорАналитикаУчетаНоменклатуры");
	ЗаполняемыеПоля.Вставить("ДокументДвижения");
	ЗаполняемыеПоля = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(ЗаполняемыеПоля);
	
	Запись = РасчетСебестоимостиТоваров.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, Выборка, ЗаполняемыеПоля);
	Запись.Стоимость       = Выборка.СтоимостьКорректировка + Выборка.СуммаДопРасходовКорректировка;
	Запись.СтоимостьБезНДС = Выборка.СтоимостьБезНДСКорректировка + Выборка.СуммаДопРасходовБезНДСКорректировка;
	Запись.СтоимостьРегл   = Выборка.СтоимостьРеглКорректировка;
	
	Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаТоваров Тогда
		Запись = РасчетСебестоимостиТоваров.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, Выборка, ЗаполняемыеПоля);
		Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров;
		Запись.Стоимость             = Выборка.СтоимостьКорректировка + Выборка.СуммаДопРасходовКорректировка;
		Запись.СтоимостьБезНДС       = Выборка.СтоимостьБезНДСКорректировка + Выборка.СуммаДопРасходовБезНДСКорректировка;
		Запись.СтоимостьРегл         = Выборка.СтоимостьРеглКорректировка;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти // РасчетСебестоимостиТоваров

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#КонецЕсли
